<?php

namespace App\Service;

class SlugGenerator
{
    public function generate($input)
    {
        $input = trim($input);
        $replace = str_replace(
            array(
                'à', 'â', 'ä', 'á', 'ã', 'å', 'æ',
                'î', 'ï', 'ì', 'í',
                'ô', 'ö', 'ò', 'ó', 'õ', 'ø', 'œ',
                'ù', 'û', 'ü', 'ú',
                'é', 'è', 'ê', 'ë',
                'ì', 'í', 'î', 'ï',
                'ð', 'ñ', 'š',
                'ç', 'ÿ', 'ý', 'ñ', ' ', "'",
                'É', 'È', 'Ê', 'Ë',
                'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Æ',
                'Ç',
                'Ì', 'Í', 'Î', 'Ï',
                'Ð',
                'Ñ',
                'Ò', 'Ó', 'Ô', 'Õ', 'Ö', 'Ø', 'Œ',
                'Š',
                'þ', 'Þ',
                'Ù', 'Ú', 'Û', 'Ü',
                'Ý', 'Ÿ',
            ),
            array(
                'a', 'a', 'a', 'a', 'a', 'a', 'ae',
                'i', 'i', 'i', 'i',
                'o', 'o', 'o', 'o', 'o', 'o', 'o',
                'u', 'u', 'u', 'u',
                'e', 'e', 'e', 'e',
                'i', 'i', 'i', 'i',
                'd', 'n', 's',
                'c', 'y', 'y', 'n', '-', '-',
                'E', 'E', 'E', 'E',
                'A', 'A', 'A', 'A', 'A', 'A', 'AE',
                'C',
                'I', 'I', 'I', 'I',
                'D',
                'N',
                'O', 'O', 'O', 'O', 'O', 'O', 'OE',
                'S',
                'p', 'p',
                'U', 'U', 'U', 'U',
                'Y', 'Y',
            ),
            $input
        );

        return $replace;
    }
}
